/*!**************************************************************************************************
\copyright Copyright (C) 2019	
\defgroup       
\file           Drv_DigitalTube_Private.h
\brief          
\history:
\version        1.0
\author         YJH
\date           19/11/25 12:09
\remarks        No Remarks
****************************************************************************************************/
#pragma once

/**************************************START OF THE FILE****************************************************************/
#include "../User/Driver/DigitalTube/Drv_DigitalTube_Global.h"

/*!*************************************************************************************************
\brief	记录每一位数码管的状态
****************************************************************************************************/
typedef struct
{
    BOOL boSwitch;//数码管开关
    BOOL IFRefresh;//是否需要刷新该数码管，TRUE==需要刷新
    BOOL boCommonAnode;//TRUE:共阳极 ; FALSE:共阴极
    //BOOL IFNeedPoint;//是否显示该数码管小数点，TRUE==显示小数点

    ENixieTubeDisplay NixieTubeLEDStatus[NIXIE_TOTAL_NUM];//3位数码管的显示数据

}SNixieTubeCommonVar;

/*!*************************************************************************************************
\brief	数码管LED的状态
****************************************************************************************************/
enum ETubeLEDStatus
{
    E_TUBE_LED_OFF,
    E_TUBE_LED_ON,
    E_TUBE_LED_FLASH,
    E_TUBE_LED_DIM,
};

/*!*************************************************************************************************
\brief	数码管的位
****************************************************************************************************/
enum ENixieTubePosition
{
    E_POS_ONE,//个位
    E_POS_TWO,//十位
    E_POS_THR,//百位
};




/****************************************END OF THE FILE***************************************************************/



